/*
 * SQL練習問題 家計簿 データ追加
*/

USE test;

INSERT
  INTO 家計簿
  VALUES
    ('2013-2-3','食費','コーヒーを購入',0,380)
   ,('2013-2-10','給料','1月の給料',280000,0)
   ,('2013-2-11','教養娯楽費','書籍を購入',0,2800)
   ,('2013-2-14','交際費','同期会の会費',0,5000)
   ,('2013-2-18','水道光熱費','1月の電気代',0,7560)
  ;

INSERT
  INTO 家計簿アーカイブ
  VALUES
    ('2012-12-10','給料','11月の給料',280000,0)
   ,('2012-12-18','水道光熱費','水道代',0,4200)
   ,('2012-12-24','食費','食費',0,5000)
   ,('2012-12-25','居住費','1月の家賃支払い',0,80000)
   ,('2013-1-10','給料','12月の給料',280000,0)
   ,('2013-1-13','教養娯楽費','スッキリシネマズ',0,1800)
   ,('2013-1-13','食費','新年会',0,5000)
   ,('2013-1-25','居住費','2月の家賃支払い',0,80000)
  ;

